; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v6 ?v10)
             (pred_11 ?v2 ?v3)
             (pred_2 ?v6 ?v3)
             (pred_4 ?v8 ?v6 )
	     (pred_7 ?v6)
             (pred_9 ?v9)
             (pred_5 ?v2)
             (pred_6 ?v3)
             (pred_8 ?v6)
             (pred_3 ?v2)
             (pred_12 ?v6)
             (pred_1 ))



(:action op_3
:parameters (?v12 ?v7 ?v5 ?v11)
:precondition (and (pred_9 ?v12) (pred_9 ?v7) (pred_5 ?v5) (pred_6 ?v11)
          (pred_10 ?v12 ?v7) (pred_11 ?v5 ?v11)
                   (pred_2 ?v7 ?v11) (pred_7 ?v12) 
                   (pred_8 ?v7) (pred_3 ?v5))
:effect (and  (pred_12 ?v7) (not (pred_8 ?v7))))


(:action op_4
:parameters (?v12 ?v4)
:precondition (and (pred_9 ?v12) (pred_9 ?v4)
               (pred_7 ?v12) (pred_10 ?v12 ?v4) (pred_12 ?v4))
:effect (and (pred_7 ?v4) (not (pred_7 ?v12))))

(:action op_5
:parameters (?v12 ?v5)
:precondition (and (pred_9 ?v12) (pred_5 ?v5) 
                  (pred_7 ?v12) (pred_4 ?v5 ?v12) (pred_1 ))
:effect (and (pred_3 ?v5)
   (not (pred_4 ?v5 ?v12)) (not (pred_1 ))))


(:action op_2
:parameters (?v12 ?v13 ?v1)
:precondition (and (pred_9 ?v12) (pred_5 ?v13) (pred_5 ?v1)
                  (pred_7 ?v12) (pred_3 ?v1) (pred_4 ?v13 ?v12))
:effect (and (pred_3 ?v13) (pred_4 ?v1 ?v12)
        (not (pred_3 ?v1)) (not (pred_4 ?v13 ?v12))))

(:action op_1
:parameters (?v12 ?v5)
:precondition (and (pred_9 ?v12) (pred_5 ?v5) 
                  (pred_7 ?v12) (pred_3 ?v5))
:effect (and (pred_1 ) (pred_4 ?v5 ?v12) (not (pred_3 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_05 obj_06 obj_10 obj_03 obj_13 obj_08 obj_18 obj_09 obj_07 obj_20 obj_02 obj_16 obj_19 obj_22 obj_17
    obj_01 obj_15 obj_04
    obj_21 obj_12 obj_14
    )

    (:init
       (pred_1)

       (pred_9 obj_11)
       (pred_9 obj_05)
       (pred_9 obj_06)
       (pred_9 obj_10)
       (pred_9 obj_03)
       (pred_9 obj_13)
       (pred_9 obj_08)
       (pred_9 obj_18)
       (pred_9 obj_09)
       (pred_9 obj_07)
       (pred_9 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_16)
       (pred_9 obj_19)
       (pred_9 obj_22)
       (pred_9 obj_17)
       (pred_6 obj_01)
       (pred_6 obj_15)
       (pred_6 obj_04)
       (pred_5 obj_21)
       (pred_5 obj_12)
       (pred_5 obj_14)

       (pred_10 obj_11 obj_03)
       (pred_10 obj_11 obj_05)
       (pred_10 obj_05 obj_13)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_05 obj_11)
       (pred_10 obj_06 obj_08)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_10 obj_18)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_03 obj_09)
       (pred_10 obj_03 obj_13)
       (pred_10 obj_03 obj_11)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_13 obj_08)
       (pred_10 obj_13 obj_05)
       (pred_10 obj_13 obj_03)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_08 obj_06)
       (pred_10 obj_08 obj_13)
       (pred_10 obj_18 obj_02)
       (pred_10 obj_18 obj_10)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_09 obj_16)
       (pred_10 obj_09 obj_07)
       (pred_10 obj_09 obj_03)
       (pred_10 obj_07 obj_19)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_07 obj_13)
       (pred_10 obj_07 obj_09)
       (pred_10 obj_20 obj_22)
       (pred_10 obj_20 obj_02)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_02 obj_17)
       (pred_10 obj_02 obj_18)
       (pred_10 obj_02 obj_20)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_16 obj_09)
       (pred_10 obj_19 obj_22)
       (pred_10 obj_19 obj_07)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_22 obj_17)
       (pred_10 obj_22 obj_20)
       (pred_10 obj_22 obj_19)
       (pred_10 obj_17 obj_02)
       (pred_10 obj_17 obj_22)
       (pred_8 obj_16)
       (pred_8 obj_19)
       (pred_8 obj_07)
       (pred_2  obj_16 obj_01)
       (pred_2  obj_19 obj_15)
       (pred_2  obj_07 obj_04)
       (pred_12 obj_11)
       (pred_12 obj_05)
       (pred_12 obj_06)
       (pred_12 obj_10)
       (pred_12 obj_03)
       (pred_12 obj_13)
       (pred_12 obj_08)
       (pred_12 obj_18)
       (pred_12 obj_09)
       (pred_12 obj_20)
       (pred_12 obj_02)
       (pred_12 obj_22)
       (pred_12 obj_17)

       (pred_11  obj_21 obj_01)
       (pred_11  obj_12 obj_15)
       (pred_11  obj_14 obj_04)
       (pred_4 obj_21 obj_06)
       (pred_4 obj_12 obj_08)
       (pred_4 obj_14 obj_17)
       (pred_7 obj_13)
    )

    (:goal (and
       (pred_4 obj_21 obj_22)
       (pred_4 obj_14 obj_11)
    ))
(:constraints
  (always (not (pred_7 obj_20)))
)
)

; plan
1. (op_4 obj_13 obj_08)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_08)
   goals met: 0 of 2
2. (op_4 obj_08 obj_18)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_18)
   goals met: 0 of 2
3. (op_4 obj_18 obj_02)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_02)
   goals met: 0 of 2
4. (op_4 obj_02 obj_17)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_17)
   goals met: 0 of 2
5. (op_5 obj_17 obj_14)
   deleted: (pred_4 obj_14 obj_17) (pred_1)
   added: (pred_3 obj_14)
   goals met: 0 of 2
6. (op_4 obj_17 obj_02)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_02)
   goals met: 0 of 2
7. (op_4 obj_02 obj_18)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_18)
   goals met: 0 of 2
8. (op_4 obj_18 obj_08)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_08)
   goals met: 0 of 2
9. (op_4 obj_08 obj_06)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_06)
   goals met: 0 of 2
10. (op_4 obj_06 obj_05)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_05)
   goals met: 0 of 2
11. (op_4 obj_05 obj_11)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_11)
   goals met: 0 of 2
12. (op_1 obj_11 obj_14)
   deleted: (pred_3 obj_14)
   added: (pred_1) (pred_4 obj_14 obj_11)
   goals met: 1 of 2
13. (op_4 obj_11 obj_05)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_05)
   goals met: 1 of 2
14. (op_4 obj_05 obj_06)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_06)
   goals met: 1 of 2
15. (op_5 obj_06 obj_21)
   deleted: (pred_4 obj_21 obj_06) (pred_1)
   added: (pred_3 obj_21)
   goals met: 1 of 2
16. (op_4 obj_06 obj_08)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_08)
   goals met: 1 of 2
17. (op_4 obj_08 obj_18)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_18)
   goals met: 1 of 2
18. (op_4 obj_18 obj_02)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_02)
   goals met: 1 of 2
19. (op_4 obj_02 obj_17)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_17)
   goals met: 1 of 2
20. (op_4 obj_17 obj_22)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_22)
   goals met: 1 of 2
21. (op_1 obj_22 obj_21)
   deleted: (pred_3 obj_21)
   added: (pred_1) (pred_4 obj_21 obj_22)
   goals met: 2 of 2
